### Pandas

#### Creating a dataframe

In [4]:
import pandas as pd
import numpy as np

In [68]:
df1 = pd.DataFrame({'a':np.random.rand(10),
                 'f':np.random.randint(10, size=10),
                 'count':[True,True,True,False,False,np.nan,np.nan,
                      False,True,True],
                 'b':['London','Paris','New York','Istanbul',
                      'Liverpool','Berlin',np.nan,'Madrid',
                      'Rome',np.nan],
                 'd':[3,4,5,1,5,2,2,np.nan,np.nan,0],
                 'e':[1,4,5,3,3,3,3,8,8,4]})
df1

          a  f  count          b    d  e
0  0.782049  7   True     London  3.0  1
1  0.989120  7   True      Paris  4.0  4
2  0.337312  4   True   New York  5.0  5
3  0.985752  2  False   Istanbul  1.0  3
4  0.769678  7  False  Liverpool  5.0  3
5  0.367682  5    NaN     Berlin  2.0  3
6  0.338633  5    NaN        NaN  2.0  3
7  0.551978  6  False     Madrid  NaN  8
8  0.309606  9   True       Rome  NaN  8
9  0.334391  9   True        NaN  0.0  4

In [53]:
#OR
pd.Series([1, 2, 3, np.nan])

#OR
days =pd.Series(["Monday","Tuesday","Wednesday"])

#OR
numpy_day= np.array(["Monday","Tuesday","Wednesday"])
panda_day= pd.Series(numpy_day)

#OR
days =pd.Series(["Monday","Tuesday","Wednesday"], index=['a','b','c'])

#OR
days_alt= pd.Series({"a":"Monday", "b": "Tuesday", "c":"Wednesday"})

#OR

df_dict={"Country":["Ghana", "Kenya", "Nigeria", "Togo"],
        "Capital": ["Accra", "Nairobi", "Abuja", "Lome"],
        "Population": [10000,8500,35000,12000],
        "Age":[60,70,80,75]}

#OR
df=pd.DataFrame(df_dict, index=[2,4,6,8])

## Selecting Data

at, iat ,iloc and loc allows selecting part of a DataFrame.

iloc: Select by position

loc: Select by label

at and iat are used to retrieve single values such that at uses the column and row labels and iat uses indices.

In [38]:
df.iloc[2] #Use default reference values

df.loc[6] #Uses specific index values

df.loc[6] == df.iloc[2]

Country       True
Capital       True
Population    True
Age           True
Name: 6, dtype: bool

In [42]:
print(df.iat[2,0])        #Uses default reference index

#OR

print(df.at[6,"Country"]) #Uses Specified reference index

Nigeria
Nigeria

#### Working with pandas

In [22]:
df.describe()

df.mean()

#value_counts() shows the values in a column with number of occurrences
df.c.value_counts()

# dtypes Used to check for Data Type\
df.dtypes

#using NaN as integer data type.
pd.Series([1, 2, 3, np.nan], dtype=pd.Int64Dtype())   #Otherwise it is represented as a Float integer

True     7
False    3
Name: c, dtype: int64

In [36]:
df.Age 
#or
df["Age"]

2    60
4    70
6    80
8    75
Name: Age, dtype: int64

## Handling missing Values

Before handling missing values, we need to check the number of missing values in the DataFrame.
This step is important because the ratio of missing values in a row or column plays a critical role in how to handle them. isna() check if an entry is NaN (missing).

In [57]:
# When combined with sum method, it gives the total number of missing values in each column:
df.isna().sum()

#When combined with any(), it returns a boolean value indicating if there is any missing value in that column:
df.isna().any()

df.dropna()  #Drop all rows with NA
df.reset_index(drop=True)

   Country  Capital  Population  Age
0    Ghana    Accra       10000   60
1    Kenya  Nairobi        8500   70
2  Nigeria    Abuja       35000   80
3     Togo     Lome       12000   75

In [14]:
#We can replace the missing values in a column with the maximum value of that column
df.d.fillna(df.d.max(), inplace=True)  

# It is important to set inplace parameter as True. Otherwise the changes are not saved.

Depending on the situation, we may decide to drop a row or column if there are too many missing values. Filling many missing values without prior knowledge may negatively influence our analysis. There are 5 columns in our DataFrame and I want to only keep samples (rows) that have at least 4 values. In other words, rows with at least 2 missing values will be dropped. We can use dropna function with thresh parameter. Axis parameter is used to indicate row (0) or column (1).

In [16]:
df.dropna(thresh=4, axis=0, inplace=True)
df

#The argument of thresh parameter is the number of non-missing values a row or column need to have not to be dropped.

          a          b      c    d  e
0  0.256650     London   True  3.0  1
1  0.541024      Paris   True  4.0  4
2  0.931394   New York   True  5.0  5
3  0.473618   Istanbul  False  1.0  3
4  0.553656  Liverpool  False  5.0  3
5  0.303819     Berlin    NaN  2.0  3
7  0.305444     Madrid  False  5.0  8
8  0.580895       Rome   True  5.0  8
9  0.279300        NaN   True  0.0  4

We can also fill the missing values with the values that come before or after it. This method is mostly used in time series data. The method parameter is used with ‘ffill’ (propagate forward) or ‘bfill’ (propagate backward) arguments:

In [ ]:
df.b.fillna(method='ffill', inplace=True)
df

We can also fill missing values with the most common value in that column. Value_counts() sorts the values according to their number of occurrences in a column. So we can use the index of value_counts() to get the most common value:

In [45]:
df.c.fillna(df.c.value_counts().index[0], inplace=True)
df

#   fillna({'profession' : 'lawyer', 'experience' : 52, 'height' : 12})

AttributeError: 'DataFrame' object has no attribute 'c'

### Reading Data

Reading Excel File

The read_excel() method can read Excel 2003 (.xls) and Excel 2007+ (.xlsx) files using the xlrd Python module. The to_excel() instance method is used for saving a DataFrame to Excel. Generally the semantics are similar to working with csv data. See the cookbook for some advanced strategies

In [ ]:
# Returns a DataFrame
Data = read_csv('path_to_file.xls', sheet_name='Sheet1')

## Data Types and Data Wrangling

In [50]:
csv_df= pd.read_csv('dataset.csv')

csv_df.to_csv("Dataset_copy.csv", index =False)

In [ ]:
https://github.com/WalePhenomenon/climate_change/blob/master/fuel_ferc1.csv?raw=true

In [63]:
url ='https://github.com/WalePhenomenon/climate_change/blob/master/fuel_ferc1.csv?raw=true'

trial_csv= pd.read_csv(url, error_bad_lines=False)

trial_csv.describe()

,utility_id_ferc1,report_year,fuel_qty_burned,fuel_mmbtu_per_unit,fuel_cost_per_unit_burned,fuel_cost_per_unit_delivered,fuel_cost_per_mmbtu
count,29523.000000,29523.000000,2.952300e+04,29523.000000,29523.000000,2.952300e+04,29523.000000
mean,118.601836,2005.806050,2.622119e+06,8.492111,208.649031,9.175704e+02,19.304354
std,74.178353,7.025483,9.118004e+06,10.600220,2854.490090,6.877593e+04,2091.540939
min,1.000000,1994.000000,1.000000e+00,0.000001,-276.080000,-8.749370e+02,-41.501000
25%,55.000000,2000.000000,1.381700e+04,1.024000,5.207000,3.778500e+00,1.940000
50%,122.000000,2006.000000,2.533220e+05,5.762694,26.000000,1.737100e+01,4.127000
75%,176.000000,2012.000000,1.424034e+06,17.006000,47.113000,4.213700e+01,7.745000
max,514.000000,2018.000000,5.558942e+08,341.260000,139358.000000,7.964521e+06,359278.000000

In [64]:
trial_csv.to_csv('FuelData.csv')